src/cf/InformationRegisters/уатНастройкиЗаполненияПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНастройкиЗаполненияПоУслугам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШаблоныЗаполненияПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНастройкиЗаполненияПоУслугам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Договор) И НЕ ЗначениеЗаполнено(Запись.Контрагент) Тогда
		Запись.Контрагент = Запись.Договор.Владелец;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьНастроекЗаполненияПоУслугам");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ТекущийОбъект.Выбран() Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатНастройкиЗаполненияПоУслугам.Договор КАК Договор,
		|	уатНастройкиЗаполненияПоУслугам.Шаблон КАК Шаблон
		|ИЗ
		|	РегистрСведений.уатНастройкиЗаполненияПоУслугам КАК уатНастройкиЗаполненияПоУслугам
		|ГДЕ
		|	уатНастройкиЗаполненияПоУслугам.Договор = &Договор");
		Запрос.УстановитьПараметр("Договор", Запись.Договор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда	
			ТекстОшибки =
				СтрШаблон("Для договора ""%1"" уже указан шаблон заполнения ""%2"" (можно указать только один шаблон)!",
				Запись.Договор, Выборка.Шаблон);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
